2022-05-12

Start compute at 2022-05-12 11:36:20
Finish compute at 2022-05-12 22:00:52, after 10:19:09.62

data_path: /storage/replicated/cirad_users/linkwongchonc/dataset/2_corrected/2018_2020_25x25_0,8/
output_path: /lustre/linkwongchonc/output/model/

Xtrain size: (493049, 25, 25, 4)
Xval size: (197219, 25, 25, 4)
Xtest size: (295830, 25, 25, 4)

Ytrain size: (493049, 4)-(493049, 11)-(493049, 27)
Yval size: (197219, 4)-(197219, 11)-(197219, 27)
Ytest size: (295830, 4)-(295830, 11)-(295830, 27)

Xtrain 50% [Loss, Accuracy]: 0.04068459942936897 0.002983969636261463 0.011953339911997318 0.025747304782271385 0.9991339445114136 0.9959415793418884 0.9901490807533264
Xval 20% [Loss, Accuracy]: 0.9304208755493164 0.12952135503292084 0.3348090350627899 0.4660901725292206 0.9810971617698669 0.9531028866767883 0.9296011328697205
Xtest 30% [Loss, Accuracy]: 0.9278320670127869 0.13276635110378265 0.33150795102119446 0.46355772018432617 0.9814994931221008 0.9533346891403198 0.9290977716445923

Model: "deeprun"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 25, 25, 4)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 19, 19, 32)   6304        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 19, 19, 32)   128         conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 17, 17, 1024) 295936      batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 17, 17, 1024) 4096        conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 17, 17, 32)   294944      batch_normalization_1[0][0]      
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 17, 17, 1056) 0           conv2d_1[0][0]                   
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 17, 17, 1024) 1082368     concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 17, 17, 1024) 4096        conv2d_3[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 1024)         0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dense (Dense)                   (None, 300)          307500      global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 300)          307500      global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 300)          307500      global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
lvl1 (Dense)                    (None, 4)            1204        dense[0][0]                      
__________________________________________________________________________________________________
lvl2 (Dense)                    (None, 11)           3311        dense_1[0][0]                    
__________________________________________________________________________________________________
lvl3 (Dense)                    (None, 27)           8127        dense_2[0][0]                    
==================================================================================================
Total params: 2,623,014
Trainable params: 2,618,854
Non-trainable params: 4,160
__________________________________________________________________________________________________
