2022-05-23

Start compute at 2022-05-23 08:09:20
Finish compute at 2022-05-23 11:02:21, after 02:50:12.35

data_path: /storage/replicated/cirad_users/linkwongchonc/dataset/2_corrected/2018_2020_25x25_0,8/
output_path: /lustre/linkwongchonc/output/dock/n3/

Xtrain size: (493049, 25, 25, 4)
Xval size: (197219, 25, 25, 4)
Xtest size: (295830, 25, 25, 4)

Ytrain size: (493049, 27)
Yval size: (197219, 27)
Ytest size: (295830, 27)

Xtrain 50% [Loss, Accuracy]: 0.10534263402223587 0.9598336219787598
Xval 20% [Loss, Accuracy]: 0.30195027589797974 0.9154239892959595
Xtest 30% [Loss, Accuracy]: 0.29739654064178467 0.9162221550941467

Model: "deeprun"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 25, 25, 4)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 19, 19, 512)  100864      input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 19, 19, 512)  2048        conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 17, 17, 256)  1179904     batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 17, 17, 256)  1024        conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 17, 17, 170)  391850      batch_normalization_1[0][0]      
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 17, 17, 426)  0           conv2d_1[0][0]                   
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 17, 17, 128)  54656       concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 17, 17, 128)  512         conv2d_3[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 128)          0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dense (Dense)                   (None, 100)          12900       global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 27)           2727        dense[0][0]                      
==================================================================================================
Total params: 1,746,485
Trainable params: 1,744,693
Non-trainable params: 1,792
__________________________________________________________________________________________________
